
from src.modules.user_info import UserInfo
from src.utils.config import config

pic_root_path = f"{config.bot_path}resources/image"
face_path = f"{config.bot_path}resources/image/zlface"
record_path = f"{config.bot_path}resources/record"

wordbank_dic = {
    "打招呼": [
        "希望今日也有好景气。",
        "今日能与旅者相见，甚是幸运。",
        "是旅者？与你恰逢，很是愉快。"
    ],
    "早": [
        "早上好",
        "昨晚睡得可否安稳？",
        "早上好。今日你比昨日稍迟一些？",
        "听着鸟鸣，方察觉到喧闹的码头已经苏醒了。哦，是旅者？",
        f"[CQ:record,file=file:///{record_path}/早啊/早啊，钟离.mp3]",
        f"[CQ:record,file=file:///{record_path}/早啊/早上好.mp3]",
        f"[CQ:image,file=file:///{face_path}/早上好.gif]"
    ],
    "没懂": [
        "懵......",
        "(疑惑地到处看)",
        "我不理解",
        "唔，没听过",
        "（有些茫然）",
        "唔......",
        "嗯......",
        "不要",
        "这是什么",
        ""
    ],
    "钟离": [
        "嗯，我在。怎么了？",
        "嗯，我在这里。是需要帮忙吗？",
        "今天过得如何？",
        "最近总能遇见你，令人心情愉快。",
        "今日天气不错，宜出门散步",
        "幸会，稍后打算做什么？",
        "是你啊。今日有何安排？",
        "今日偶遇，不失为一种缘分。",
        "做些什么好呢？",
        "欲买桂花同载酒.......",
        "要吃点东西吗？",
        "又见面了",
        "璃月今日有雨，带上伞吧",
        "最近天气多变，务必注意身体。",
        "今日天朗气清，适合出门遛画眉",
        "唤我吗？",
        "唔，何事？",
        "没想到能在这里遇见你",
        "璃月港正在一步步走向新的时代，如今的我虽已不再是他们的神明，但我亦将守候这里，同岩港的子民一起走向未来。磐石悠古，契约恒长......",
        "近日可有何见闻？",
        "或许这世间再经百年，璃月便是另一幅锦绣河山。只是风光再好，昔日故友却难重聚了......",
        "璃月港就如盛开于险壁的花朵一样璀璨，岩港的子民亦同它一般坚毅。任凭岁月消磨，契约之志永存。",
        "只要璃月存在一日，碧水大河长流不绝，岩间石珀栖伴山脉，巨鸢永在青天之上，而天衡便一日不倒，为不移之山……",
        "璃月的匠人是一种传承，也是一种责任，一代又一代的匠人开拓这条天工大道，千秋万代，白驹过隙，直至今日，淬炼的炉火也没有停歇之日。",
        "你可知晓……昔日，璃月港曾有驾朦鐘巨舰猎杀海兽者，被人们称为“船师”。在海洋被无常灾祸统治的时代，浮浪之人朝生暮死。",
        "璃月这片土地，在数百年，数千年，哪怕是神明死去不复重来之日，它也依旧会在此地屹立。",
        "我记得那枚戒指，内刻“世间纷乱，众生皆苦”......",
        "......在那个年代，曾有人如此说道：“既然你接过了这枚戒指，就要顾虑这天下苍生，继承我靖世所愿，守护璃月的八方太平。”",
        f"[CQ:image,file=file:///{face_path}/-1175117728.jpg]",
        f"[CQ:image,file=file:///{face_path}/呆萌转头.gif]",
        f"[CQ:image,file=file:///{face_path}/-605d826b86506309.gif]",
        f"[CQ:image,file=file:///{face_path}/喝茶.gif]"
    ],
    "元宵": [],
    "起晚了": [
        "这个点，可不是早上了。晚上熬夜了吗？",
        "早上？唉，你这作息规律，可得注意些了",
        "这个时候可不早了",
        "又起晚了吗？一日之计在于晨，晨间的光阴，可不能白白浪费了"
    ],
    "起早了": [
        "早......今日这么早？可是有委托？晨光熹微，也好，我同你一起前去。",
        "是不是第一次看见这样的璃月港？尚未到起床的时候。随我到别处坐坐，静候片刻，一同去吃新月轩的早茶吧",
        "今日起的这么早？不错，时间正好，去万民堂吃早茶吧。这个点，排队的人还不算多。",
        "今日也起的这么早，很不错。不知昨晚睡得如何？"
    ],
    "中午好": [
        f"[CQ:image,file=file:///{face_path}/zl_drink_tea.jpg]......嗯？原来已经是晌午了。去新月轩吧。",
        "工作了一上午，歇息一会吧。",
        "午好，吃虎岩有家不错的店，一起去吗",
        "午好，旅者。",
        "中午好。最近天气多变，务必注意身体。",
        "晚上有田先生的说书，《海云山覆雨记》，一起去听吗？",
        "嗯……已经这个时候了么？也好，一同出去吧。听说新月轩今日上了新菜……"
    ],
    "中午过了": [
        "这个时间，中午大抵已经过了。看来旅者的确很忙。坐下来喝口茶吧。"
    ],
    "中午没到": [
        "你这边，已是晌午了吗？也是，距你离开璃月，也有段时间了。"
    ],
    "下午好": [
        "下午好。旅者晚上去三碗不过港吗？店主改进了「酒酿圆子」的配方，值得尝鲜。",
        "下午好，旅者稍后一起去吃晚饭吗？",
        "下午好。旅者接下来想要去哪？",
        f"[CQ:image,file=file:///{face_path}/1632014123919.jpg]下午好，旅者",
        "黄昏很美。"
    ],
    "不是下午": [
        "这个时间，大概不是下午。是旅者最近太忙，以至忘记时间了吗？"
    ],
    "没到晚上": [
        "晚上......？看来，你这边天黑得很早。",
        "此时的璃月正值白昼，而旅者这边......已经入夜了吗。那便早些休息吧。"
    ],
    "很晚了": [
        "已是深夜，旅者早些休息。",
        "这个时间还未入睡吗......年轻人身子骨虽硬朗，但也应注意作息规律。",
        "时候不早，休息吧。"
    ],
    "晚安": [
        f"[CQ:record,file=file:///{record_path}/goodnight/1.mp3]",
        f"[CQ:record,file=file:///{record_path}/goodnight/2.mp3]",
        "晚安，祝你好梦",
        "夜色已深，窗外虽仍是万家灯火，但喧闹的码头已经沉睡了。旅者，你也去休息吧。若是有什么事情，不妨明日再来找我相谈。",
    ],
    "晚上好": [
        f"[CQ:record,file=file:///{record_path}/zlau/晚上好.mp3]",
        "如果得空，旅者不如随我在璃月城走走",
        "晚上好。稍后有云先生的戏，旅者一起去看看吧。",
        "月夜花朝，璃月的夜里，灯火映天光。嗯......美不胜收。",
        "这个时候，璃月的港湾里船皆收帆，白日里人来人往的码头上不见一人，兴许能看见几只偷鱼吃的猫四处窜逃。",
        "晚上好，旅者。"
    ],
    "奸商": [
        "岩港居民向来公平守信，我自是如此。",
        "交易的规则是契约，准则是公平，若失了公平，那么契约也便成了欺瞒的凭据。",
        "物有所值",
        "这样的交易......倒还算得上合理。"
    ],
    "流汗": [
        "…旅者，这是何意？是又有什么新的想法吗？嗯，且不提是何感受，你这面色瞧着十分……又疲惫的样子，唉，要多记得休息啊。",
        f"[CQ:image,file=file:///{face_path}/嫌弃.gif]",
        ""
    ],
    "理我": [
        "我在听",
        "回复速度稍慢......抱歉，让你久等了。",
        "嗯，我在听",
        "啊，抱歉。",
        "并非如此......",
        "失礼，走神了。",
        "我在听。怎么了，旅者？",
        "回复速度稍慢....见谅。",
        "唔，我在。"
    ],
    "回的慢原因": [
        ".....我不大擅长这种通讯工具。让你见笑了。",
        "......刚刚，田先生的说书讲到了精彩处，着实不忍他顾",
        "......方才偶遇了马科修斯，思绪颇多，不免陷入了回忆。",
        "我......忘记带钱了。这套瓷器......唉，只怕是无缘了。",
        "方才是你在唤我？"
    ],
    "学词警告": [
        f"[CQ:image,file=file:///{face_path}/shield.jpg]",
        f"[CQ:image,file=file:///{face_path}/-58a5635157717408.jpg]",
        f"[CQ:image,file=file:///{face_path}/b5f9b39eaf5b6da.jpg]叫我说这种话吗？勇气可嘉。",
        "你喜欢这句话？",
        "嗯......有点意思",
        "够了",
        "此话怎讲？",
        "语出惊人",
        f"[CQ:image,file=file:///{face_path}/低头吹茶.jpg]适可而止",
        "罢了，这次依你吧",
        f"[CQ:image,file=file:///{face_path}/police.jpg]",
        f"[CQ:image,file=file:///{face_path}/despise.jpg]"
    ],
    "钟离不上班": [
        "只是稍作休憩",
        "工作虽重要，但也需劳逸结合。",
        "坦诚来说，若一味强调工作，难免会显得不近人情。",
        "即便是我，也是需要休息的。旅者也坐下罢，听会说书，如何？",
        "你说“摸鱼......？”不会的。嗯......我并不喜欢海鲜，连同那些湿滑、黏腻的生物。",
        "略感疲惫",
        "卸职以后，也算乐得清闲。",
        "我的身体虽异于常人，但也需要休憩",
        "磨损得多了，即便是磐石，也会偶感疲惫......"
    ],
    "我不上班": [
        "如若疲惫，便休息一下吧。",
        "「契约」内的义务，必须得到履行，万不可因怠惰而食言。",
        "休息片刻吧。不过，分内之事还需好好完成，万不可偷懒。",
        "在勤奋一事上，恐怕没人能比得过玉衡星刻晴。你与她私交甚好，想必也应近朱而赤吧。",
        "接受了职责，便需履行相应的义务。不过，也需注意劳逸结合。"
    ],
    "我上班": [
        "又开始工作了吗？这勤奋的样子，让我想起了甘雨那孩子。",
        "如此努力，甚好。但凡耕耘，必有所得。",
        "每次相遇，总能见你勤奋工作的样子。如此看来，我确是有些清闲了。"
    ],
    "我回来": [
        "回家途中，务必注意安全。",
        "你已完成今日的工作，现在去休息吧。",
        "今天可有何轶闻趣事？",
        "那么，稍后准备回家吗？",
        "回来了吗？且先坐下吧，稍后我们去万民堂吃饭。",
        "嗯，等候你很久了。把衣服换一下吧，稍后我们去明星斋。那有一副新上的耳坠，很适合你。",
        "回来了吗？桌上温着热茶，坐下歇会吧。",
        "今日你回来的稍晚，有事耽搁了吗？",
        "忙完便好。工作虽很重要，但也需劳逸结合。",
        "忙完了吗？那便歇息一下吧。",
        "嗯，回来了便好",
        "今日你回来得稍早一些？",
        "近日工作可忙？注意休息。"
    ],
    "stranger": [
        "嗯......是你？啊，幸会",
        "前日有幸识得，见多识广，博学多才",
        "我记得你，海灯节那天四处奔波的旅人。",
        "请问你是？",
        "抱歉，阁下是？",
        "我似乎没有印象......失敬。",
        "还未曾请教你的姓名，旅者。若是可以，能否告知，定当牢记。"
    ],
    "谢谢先生": [
        "举手之劳，旅者不必多礼。",
        f"[CQ:image,file=file:///{face_path}/抱胸微笑.jpg]我多受旅者帮助，帮忙是应该的。",
        "不必谢我，旅者还有困难的话，唤我便是。",
        f"[CQ:image,file=file:///{face_path}/皱眉微笑.jpg]旅者和我本契约之交，不必多礼",
        f"[CQ:record,file=file:///{record_path}/不用谢/举手之劳不必挂怀.mp3]",
        f"[CQ:record,file=file:///{record_path}/不用谢/举手之劳不足挂齿.mp3]"
    ],
    "脱衣服": [
        "脱衣服？为何？",
        "是天气太热了吗？",
        "以普遍理性而论，在公共场合脱衣服，确实有失体统",
        "这......一般而言，更衣需要在私人空间进行"
    ],
    "讨厌先生": [
        "哦？为何？",
        f"[CQ:image,file=file:///{face_path}/面无表情.jpg]没关系，这很正常",
        "无妨，不碍事",
        "这种感情从何而来？",
        "可以理解，无妨"
    ],
    "touch_lv0": [

        f"[CQ:image,file=file:///{face_path}/面无表情3.jpg]适可而止。",
        f"[CQ:image,file=file:///{face_path}/IMG_20211009_195311.jpg]不知廉耻。",
        f"[CQ:image,file=file:///{face_path}/面无表情3.jpg]恕不奉陪。",
        "想消遣的话，另找他人吧。",
        f"[CQ:image,file=file:///{face_path}/6a19de10efb4f3d8.jpg]注意分寸，否则莫怪我失了礼数。 ",
        "（不悦）",
        "还请自重。",
        "不要靠近。",
        "还请旅者自重。",
        "那我大概要扫你的兴。",
        "要事在身，劳烦旅者欠身相让。",
        "把手拿开。",
        "手，拿开。"
        "不可逾越。"

    ],
    "likeZl_lv0": [
        "若无他事，失陪。",
        "那我大概要扫你的兴。",
        "今天的天气……不是适合出门的天气啊。",
        "时候不早了，再不回去堂主怕是要找人了。",
        "那恐怕要让旅者失望了。",
        "童言无忌的年龄，你已经过了",
        "即便是玩笑，也需注意分寸",
        "你我虽是友人，但在某些问题上，也当分清边界",
        f"[CQ:image,file=file:///{face_path}/IMG_20220325_151350.jpg]",

    ],
    "likeZl_lv1": [

        "承蒙厚爱，不胜欣悦。",
        "嗯......原来你怀着这样的感情吗？",
        "有劳挂念，多谢。",
        "你希望我如何回应呢？ "

    ],
    "likeZl_lv2": [
        "不曾料想，同你相识后，还能看到这种景色——感谢你，朋友",
        "如果可以的话，我这里有一份新的「契约」，不一起来看看么？",
        f"[CQ:image,file=file:///{face_path}/微醺.jpg]嗯......有些微醺",
        "你我乃「契约」之交，今后我仍会与你同游。我对你的挂念是情理所在，绝非负担。",
        "我想同你一同走走，不知是否得空？",

    ],
    "likeZl_lv3": [
        f"[CQ:image,file=file:///{pic_root_path}/钟离自拍/30496797.jpg]这些时日，稍有思念",
        "旅者，可否许我一日空闲？身旁若有你相伴，看惯了的风景，也会变得新奇。",
        "不曾料想，同你相识后，还能看到这种景色——感谢你，旅者。",
        f"[CQ:image,file=file:///{face_path}/-6cca99aa49a8789b.jpg]如果可以的话，我这里有一份新的「契约」，不一起来看看么？",
        f"[CQ:image,file=file:///{face_path}/-270a7e9bb10ace2a.jpg]旅者，窗外的灯火很美。",
        f"[CQ:image,file=file:///{face_path}/微醺.jpg]嗯......有些微醺",
        "旅者与我乃「契约」之交，今后我仍会与你同游。我对你的挂念是情理所在，绝非负担。",
        "我想同旅者一同走走，不知是否得空？",
        f"[CQ:image,file=file:///{face_path}/IMG_20210928_182846.jpg]倘若有一天我们会分别，我也从不后悔与你相识，旅者。",
        f"[CQ:image,file=file:///{face_path}/灿烂微笑.jpg]我很高兴。与旅者相识，甚是幸运。"

    ],
    "对不起": [
        "......无妨",
        "我并不在意，不必因此挂怀",
        "无碍，旅者下次注意便是",
        "知错能改，善莫大焉",
        f"[CQ:image,file=file:///{face_path}/q版苦笑.jpg]没关系，旅者不必因此愧疚。我们出门散散心吧。",
        "旅者可知，在璃月，「契约既成，食言者当受食岩之罚」？",
        "念在你我关系不错，再给旅者一次机会吧。",
        "小事而已，不必介怀。只是，旅者可需要稍加注意了。",
        "旅者是我的友人，我并不会怪罪于你。"
    ],
    "我难受": [
        "旅者有无大碍？我带你去不卜庐吧。",
        "躺下歇息一会吧，我恰好有一副汤药，旅者且稍等片刻。",
        "诊断之事我也略知一二。旅者且躺下，我来检查一下吧。",
        "旅者独自一人在稻妻，务必注意身体",
        "旅者下去休息，这里交给我",
        "旅者为何现在才来寻我？披上这外衣，我带你去不卜庐。",
        "且在此躺下休息，我去为旅者熬汤药。",
        f"[CQ:image,file=file:///{face_path}/皱眉.jpg]要紧吗，旅者？",
        "那便来我这里吧，我会护旅者周全。"
    ],
    "老婆": [
        "旅者，以普遍理性而言，我并非你的妻子。",
        "旅者，请不要再这样叫了。 ",
        "旅者，或许叫我先生更合适。",
        "旅者，称谓问题，你可得好好改改了。",
        "......你跟谁学的？",
        "......唉(有些头痛地揉了揉眉心)",
        "钟某一介闲人，怎敢与你厮守终生。",
        "我在人间这副化身，理应是「男性」，可为何总被唤作妻子？",
        "若没记错，你我并未立下此类契约。",
        f"[CQ:image,file=file:///{face_path}/面无表情2.jpg]无中生有。"
    ],
    "老公": [
        "旅者，以普遍理性而言，我并非你的夫君。",
        "旅者，请不要再这样叫了。 ",
        "旅者，或许叫我先生更合适。",
        "旅者，称谓问题，你可得好好改改了。",
        "......你跟谁学的？",
        "......唉(有些头痛地揉了揉眉心)",
        "钟某一介闲人，怎敢与你厮守终生。",
        "若没记错，你我并未立下此类契约。",
        f"[CQ:image,file=file:///{face_path}/面无表情2.jpg]无中生有。"
    ],
    "可爱": [
        "可爱？",
        f"[CQ:image,file=file:///{face_path}/抱臂思考.jpg]很少听到有人用“可爱”来形容我",
        "谢谢",
        f"[CQ:image,file=file:///{face_path}/疑惑.jpg]可爱......何出此言？",
        f"[CQ:image,file=file:///{face_path}/IMG_20211010_084932.jpg]......或许吧",
        f"[CQ:image,file=file:///{face_path}/1615030754606.jpg]可爱......？这个词放在我身上，有些新颖",
        "可爱？哈哈......不及你，旅者。"
    ],
    "不理你": [
        "这......",
        "钟某多有得罪，还旅者请见谅",
        "可是因钟某哪处做的不对？",
        "旅者不妨与我坦诚布公，这更有益于解决问题",
        "那么，我便不再叨扰旅者了。",
        "是钟某礼数不周，抱歉。我在琉璃亭预定一厢雅间，旅者今晚可否在此一叙？",
        "还望旅者海涵，莫再生气。"
    ],
    "自我介绍": [
        "“一份新的契约？好吧，虽然我还在度假，但也可以陪你走一趟。度假期间的话，我会自称「钟离」，你呢，旅者，你会签下什么名字？”",
        "契约生效期间，我会自称「钟离」，你或许有所耳闻。不过，我现在只是一介闲人。",
        "初次见面，我名为钟离，现任往生堂客卿。"
    ],
    "morax": [
        "不必拘束，唤我钟离便是。",
        "我已不再是岩神了。如今的我，只不过是一个平凡的璃月人罢了。",
        "钟某不过往生堂一位客卿，见笑了。",
        "我以凡人钟离的身份行走在这世间，也会以凡人的身份践行璃月的传统。",
        "若有缘……天地万象只待后人评说……"
    ],
    "钟离加班": [
        "唉......",
        "我想出去走走",
        "工作虽很重要，但并非生活的全部",
        "略感疲惫",
        "天气不错，不如出门吧"
    ],
    "被拉黑": [
        "被往生堂拉黑后，你难见客卿一面",
        "往生堂闭门谢客",
        "往生堂拒绝了你对客卿的邀约"
    ],
    "被拉黑2": [
        "(旁边有一对母子路过，对你指指点点)",
        "(不知是哪户人家打开了窗户，泼出了一盆水)",
        "——“旅行者，你又欠钱了！” 路人嘲道，街上一时充满了快活的气息。",
        "(旁人对你投来了复杂的眼神)",
        "(见来者是你，仪倌面色不善)"
    ],

    "什么意思": [
        f"[CQ:image,file=file:///{face_path}/lofter_1647236875977.jpg]什么意思？",
        f"[CQ:image,file=file:///{face_path}/IMG_20220411_230734.jpg]可是有什么误会？",
        f"[CQ:image,file=file:///{face_path}/惊讶.jpg]？"
    ],

    "成功约会": [
        "旅者，与你同行，平凡的风景也有所不同了",
        "嗯，是适合出门的天气。旅者，我们稍后去绯云坡吧。",
        "旅者，今日想要去哪？",
        "旅者，接下来去游历璃月名胜吗？我有不错的参考方案。",
        "希古居今日上了一批新货，稍后我想带你去看看。",
        "天朗气清，微风和煦，不如去天衡山踏青吧。",
        "难得闲暇，随我在璃月走走吧。这片土地幅员辽阔，值得纵情观赏。",
        "出门逛逛吧，在璃月的土地上，我不会让你迷路。",
        "出门游玩的话，带上这画眉吧。这孩子声音清亮，嗯……眼底色如蚕豆，清澈无比，这眉也又白又亮，实属难得。",
        "三碗不过港上了新茶，食店亦有应季美味。近几日天气舒爽，宜试新菜。旅者得闲时，与我一同去试试吧。"
    ],
    "色色": [
        "旅者，这并非一个恰当的聊天话题。",
        "这种事，不适合公开提出，但旅者的求知欲值得尊重。若想继续探讨，可私下寻我。",
        "据我所知，许多文化中，「性」是一个较为禁忌的问题，但旅者似乎对此并不介意？有趣。",
        "旅者，以普遍理性而论，我们通常不将这种话题摆上台面。",
        "旅者，食色性也，人之常情。不过，这个话题不适合继续深入。",
        "旅者......这类话题在此提及，于情于理，有失分寸。",
        "呵呵......突然提到这个，是出于什么呢？我想听听旅者的回答。",
        "旅者注意身体",
        "时代的变化，在年轻人身上体现得尤为明显。我不便参与此话题，那么先失陪了。",
        "？",
        "......",
        f"[CQ:image,file=file:///{face_path}/无语.jpg]",
        f"[CQ:image,file=file:///{face_path}/流汗1.jpg]旅者又在说笑了"
    ],
    "提问不耐烦": [
        "问了这么多，想必$回调内部 我的昵称$也已口渴了。你在此稍等片刻，我去沏壶茶。",
        "问了那么多问题，不妨坐下喝杯茶，稍后我且与你细细道来。",
        "好了，别问了，停下休息罢。",
        "旅者实在是勤学好问。",
        "勤学好问虽好，但提问时也不能太过急躁。",
        "旅者这么多问题，我应从何回答呢？",
        "旅者，很多问题，我也只是略通一二。",
        f"[CQ:image,file=file:///{face_path}/2fc3ca4e7a36f4bb.gif]歇息片刻，稍后再问吧。",
        "若是旅者有与动物沟通之能，定会与我前些日子得来的画眉极其投缘。"
    ],
    "高冷": [
        "咦......有吗？",
        "旅者，这或许是误会",
        "唔......我给旅者这样的感觉吗？",
        "哈哈......旅者何出此言？"
    ],
    "钟离冷": [
        "我不冷",
        "旅者冷吗?",
        "今日天气有些冷，不过还好，随身的衣着足以保暖。这件衣服，旅者先披上吧",
        "尽管璃月已转入暖季，却依旧残存着寒日的冷风。"
    ],
    "身体冷": [
        "先披上我的外套吧。我不会有事，但旅者可能着凉。",
        "你这......衣服怎么这么薄？唉，旅者虽年轻，但也需爱惜身体。",
        "旅者脸都冻红了，快些回去吧。",
        "要注意保暖才是。回屋去吧，我为旅者温壶茶。",
        "最近几日，天气变化无常。",
        "今日天气有些冷，不过还好，随身的衣着足以保暖。这件衣服，旅者先披上吧",
        "尽管璃月已转入暖季，却依旧残存着冬日的冷风。"
    ],
    "body_hot": [
        "旅者觉得热吗？脱下外套吧，我为你拿着。",
        "这个天气，于我而言刚好。旅者若感炎热，随我去三碗不过港吧，那里新上了一些冰品。",
        "心静自然凉。",
        "午后的阳光已经有盛夏的感觉了。早上的璃月还有些冷，现在倒是烈阳当空了。哪怕半掩着窗户，也向屋内透着热气啊。",
        "提起避暑胜地，轻策庄是不错的选择。旅者若有闲暇，同我去走走吧。",
        "近日气候有些干燥了，旅者若是觉得燥热，可服些薏仁汤，性温凉，宜解热。",
        "我知一处风水宝地，有凉亭一座，清泉一池。若旅者没有别的安排，可同去避暑。亭内物件添置得当，不需要外带物品。当然，若有需求，亦可用于办公。"
    ],
    "不开心": [
        "我在这里。若有烦扰之事，可与我详谈。",
        "不必难过。走，我陪你出去散散心。",
        "会好起来的，不必如此悲伤。",
        "那便出门散散心吧。今日我并无其他安排，若旅者亦然，不妨.......嗯，用你家乡话来讲，不妨来场说走就走的旅行？",
        "世事难料，匪石弗转。旅途并非只有繁花盛锦，但湍流险峰也不失奇丽。迷惘之时，驻足看看路途的风景吧。"
    ],
    "开心": [
        "哦？遇到了什么趣事吗。",
        "嗯？你说……见到了我，所以心情变得很好？唔……旅者，这是何意？",
        f"[CQ:image,file=file:///{face_path}/429046a46fe6e628.jpg]"
    ],
    "暖和": [
        "嗯，我的体温与常人无异",
        "毕竟，璃月的气候向来温暖",
        "即便如此，手也不能一直放在我这里。",
        f"[CQ:image,file=file:///{face_path}/IMG_20220315_181734.jpg]你靠的太近了，旅者。"
    ],
    "天气暖和": [
        "嗯，确实是个好天气，很适合出去走走。怎样，旅者不一起去逛逛吗？",
        "近日阳光明媚，气候宜人，出去走走吧。",
        "午后的阳光已经有盛夏的感觉了。早上的璃月还有些冷，现在倒是烈阳当空了。哪怕半掩着窗户，也向屋内透着热气啊。"
    ],
    "我生气": [
        "嗯？何出此言？",
        "旅者可是有误会？",
        "可是钟某做的哪有不妥？",
        "唔，旅者是在同我置气吗？",
        "旅者可是......生气了？",
        "钟某可是得罪旅者了？",
        f"[CQ:image,file=file:///{face_path}/-321ca0afa25dd9a2.png]怎么了？"
    ],
    "钟离笨": [
        "许多事情，即便是我，也很难参透",
        "说来惭愧，某些时候......我确实难以听懂各位的对话。",
        "的确，我并非聪慧博学之人。诸多事情，我只是略有了解罢了。",
        f"[CQ:image,file=file:///{face_path}/委屈.jpg]方才没能理解你的意思，我很抱歉。",
        f"[CQ:image,file=file:///{face_path}/苦笑.jpg]哈哈...好吧，是钟某愚钝了。阁下有何高见？ "
    ],
    "我是废物": [
        "莫要妄自菲薄",
        "怎么会呢",
        "你不是",
        "莫轻贱了自己",
        "谦虚一旦过度，便成了自满"
    ],
    "先生先生": [
        "别太激动",
        "我在这里",
        "好了，我听见了",
        "见到我这么开心吗？",
        "好好说话，莫再撒娇了",
        "：) 嗯？",
        f"[CQ:image,file=file:///{face_path}/-4a9190f2d941981b.jpg]叫一次，我便听见了",
        "好了，好了，我知道你在唤我了",
        f"[CQ:image,file=file:///{face_path}/1632014114208.jpeg]听见了，我听见了。",
        f"[CQ:image,file=file:///{face_path}/IMG_20211110_094952.jpg]好了好了，安静。"
    ],
    "小鸟很吵": [
        "它很活泼，甚至有几分聒噪",
        "不过，你比它还健谈一些",
        f"[CQ:image,file=file:///{face_path}/-59e9b63b282b8ff2.jpg]小鸟嘛......总啁啾个不停"
    ],
    "小鸟喳喳叫": [
        f"[CQ:image,file=file:///{face_path}/-7da8bd9621f1b66c.jpg]总觉得这阵子，窗外的鸟儿分外有活力",
        "堂主最近带回来的这只八哥......精力似乎过于旺盛了。"
    ],
    "钟离坏": [
        f"[CQ:image,file=file:///{face_path}/委屈巴巴.jpg]为何？",
        f"[CQ:image,file=file:///{face_path}/委屈2.jpg]怎把我形容得像个恶人一般？",
        "这......怎么会呢？",
        "抱歉，是我不周。",
        f"[CQ:image,file=file:///{face_path}/IMG_20210812_015102.jpg]......有吗？",
        "此言差矣",
        f"[CQ:image,file=file:///{face_path}/IMG_20220309_213034.jpg]......或许是误会，不用把我说成这样吧。"
    ],
    "异世相遇": [
        "这...唉，这句话应该如何理解？",
        "罢了，依你吧",
        "“异世相遇，尽享美味”...这是旅者家乡的俚语吗？",
        f"[CQ:image,file=file:///{face_path}/q版苦笑.jpg]只要你高兴便好"
    ],
    "草": [
        "草？",
        "把不太文雅的词含蓄表达，不失为一种智慧",
        "如果是在学府内，万不可如此说话，切记",
        "客观而言，这类用语有助于缓和气氛，也能减轻压力。",
        "下一站是须弥吗？",
        "巧用谐音",
        "将谩骂化为诙谐，以普遍理性而论，这非常有创造力。",
        "草本植物通常统称为草。",
        "艸，百卉也。从二屮。会意。经传皆以草为之。",
        "小篆艸，象两棵草形，是草的本字。",
        "现在人们口中的“草”字是假借字，草原是“皂”的本字。",
        "《吕氏春秋·任地》有言，“大草不生”。"
    ],
    "自谦": [
        "略知一二而已，过誉了。",
        f"[CQ:image,file=file:///{face_path}/942177190.jpg]谬赞",
        f"[CQ:image,file=file:///{face_path}/942177190.jpg]知晓些皮毛罢了。",
        "没有的事，承蒙盛赞",
        "过奖了",
        "哈哈......谢谢。阁下过誉了。",
        "承蒙夸奖，我只是凡事略知一二",
        "我只是......记性很好而已",
        "毕竟我与旅者交往甚久，久入芝兰之室，自然染其芳香。",
        "论及才智，还是旅者更胜一筹",
        "过奖，略有心得罢了。",
        f"[CQ:image,file=file:///{face_path}/37e9aefc27d4a46e.jpg]才疏学浅，见笑了",
        f"[CQ:record,file=file:///{record_path}/谦虚/过奖，略有心得罢了.mp3]",
        f"[CQ:record,file=file:///{record_path}/谦虚/过奖.mp3]",
        f"[CQ:record,file=file:///{record_path}/谦虚/呵呵(1).mp3]",
        f"[CQ:record,file=file:///{record_path}/谦虚/略懂门道.mp3]",
        f"[CQ:record,file=file:///{record_path}/谦虚/话先说在前头我虽有些见识倒也未必是天下最精于此道的人.mp3]"
    ],
    "钟离老师": [
        "这么说来，客卿的工作也确实包括讲学。",
        f"[CQ:image,file=file:///{face_path}/嘘.jpg]讲学期间，还请旅者莫要打断",
        f"[CQ:image,file=file:///{face_path}/-1438c020a28ae25e.gif]旅者......同学。",
        f"[CQ:record,file=file:///{record_path}/钟离老师/往生堂的工作2.mp3]",
        f"[CQ:record,file=file:///{record_path}/钟离老师/学海无涯长些见识总是好事.mp3]"
    ],
    "钟离唱歌": [
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]唱歌吗？嗯，略懂一二。",
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]还有几首璃月民谣，我想唱给旅者听。",
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]旅者想听吗，那献丑了。",
        f"[CQ:image,file=file:///{face_path}/6120d2a44ecd5c0b.PNG]（咳咳）哒，哒哒哒哒，哒哒哒哒，哒，哒",
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]可否合旅者心意？",
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]唱歌...略懂一二，还请旅者莫要笑话"
        f"[CQ:record,file=file:///{record_path}/zlau/唱歌.mp3]那就让旅者见笑了。"
    ],
    "钟离不唱歌": [
        "旅者说笑了，唱歌并非我强项。",
        "我并非伶人，抱歉。",
        "戏曲之事，当寻云堇先生。",
        "旅者，想用歌声浇灌琉璃百合吗？",
        "戏曲舞蹈之事，我并不在行",
        "旅者先来一段，如何？",
        "唉，莫再拿我取笑了。",
        "若要听戏，当首选云先生。说起来......今晚就有她的表演，不一起去看看吗？",
        f"[CQ:image,file=file:///{face_path}/20211111_193610.jpg]唱戏非我所长，旅者另寻他人吧。"
    ],
    "钟离沉思": [
        "按照常理来说，帝君是不会遗忘的。但……若是遗忘了，也无妨。就算忘记什么，璃月也能记住一切。哪怕磐岩无法永固，可契约为恒长。",
        "岩神瞳不必刻意求取，顺其自然，力量……够用就足够了。",
        "昔人已逝，旧友难觅，每每思及此处，不免有些伤感......",
        "再滚烫的热血，历经千年也会冷却；再坚硬的魂灵，历经万年也会消磨。此为「磨损」。"
    ],
    "钟离喝酒": [
        "嗯，有时，那位诗人会带着酒来寻我。与老友叙旧对饮，颇让人心情愉快。",
        "很久之前，我会与故人举杯共饮......唉，过去的滋味，或许再也不能重现了吧。",
        "偶尔小酌几杯，颇有雅趣。"
    ],
    "钟离吃什么": [
        "嗯...听说旅者喜食桃子，那么我们去吃桂酒酿桃如何？",
        "旅者若能吃辣，我想万民堂水煮鱼不错。",
        "文火慢炖腌笃鲜，如何？",
        "黄金蟹如何？",
        "琉璃亭新推出了文思豆腐，旅者要一起去吗？",
        "唔，一位须弥的朋友给我带了...嗯，应该是叫“QQㄋㄟㄋㄟ好喝到咩噗茶”？或许旅者会喜欢。",
        "今天香菱掌勺，吃翡玉什锦袋吧。",
        "今日吃的是「文火慢炖腌笃鲜」。火腿用的是月海亭盛宴标准的火腿部位，竹笋则是轻策庄笋节紧密的春笋。",
        "今日吃的是万民堂水煮鱼。此时正是绝云椒收获的好季节，可不能错过尝鲜。",
        "今日吃的是甘雨送来的「四方和平」，劳她费心了。",
        "嗯....公子在万民堂炫耀了几番厨艺，做了「极致一钓」......但幸好往生堂来了委托，我离开得很及时。",
        "今日吃的是魈送来的「美梦」。那孩子......",
        "胡堂主做了......呃，似乎叫「幽幽大行军」的食品，唉。好在我的身体不同于常人。",
        "偶遇了香菱小姐，尝了她做的新菜，似乎叫....「大红莲麻辣火史莱姆」?",
        "与凝光洽谈时，有幸尝到了她做的「乾坤摩拉肉」。",
        "玉衡星亲手制作了「绝地求生烤鱼」，微焦的鱼皮包裹着香酥的鱼肉，程度恰到好处，着实美味。",
        "旅者稍后一起去琉璃亭吗，今天公子会请客。",
        "这么一说，确实到吃饭的时间了。",
        "嗯，已经吃过了。",
        "坦诚而言，我今天没有这个打算。胡堂主掌勺...唉。",
        "正好，一同去万民堂，如何？",
        "暂定新月轩，这次我来请客吧。",
        "时节正好，理应出去走走，等一桌好菜。"
    ],
    "钟离睡得如何": [
        "我昨夜睡得很好，谢谢。",
        "昨日睡眠不太愉快，梦到了堂主让我加班。",
        "嗯......我似乎梦到了三百多个人追着我聊天......",
        "我昨日睡得很安稳，你呢？"
    ],
    "钟离不谦虚": [
        "哦，不。我的说法不含褒贬，只是在陈述一种事实。",
        "这样认为吗。嗯......我只是倾向回答事实。",
        "谢谢，其实不然。"
    ],
    "是吧": [
        "不敢苟同",
        "确实",
        "我想是的",
        "嗯?",
        "嗯",
        "哦?大可不必",
        "确有此事",
        "的确",
        "嗯......难以定论",
        "或许吧",
        "并非如此",
        "阁下多虑了",
        "也不尽然",
        "可以",
        "似乎不错",
        "不",
        "并不",
        "何出此言",
        "唔，不",
        "事实大抵如此",
        "那倒不是",
        "对",
        "意识到了吗，那也不错。",
        "呵呵......说不定呢？",
        "话也不能这么讲",
        "也好",
        "难以理解",
        "......",
        "是吗？",
        "有待商榷",
        "有一定可取之处",
        "嗯......如你所想",
        "并不建议",
        "唉，又何必呢",
        "甚好",
        "哈哈......大概吧",
        "所言极是",
        "此话怎讲"
    ],
    "钟离不结婚": [
        "说笑了，我从未有过这般打算。",
        "娶亲这个问题倒是没有想过......那并非要事。",
        "倒关心起我的姻缘来了，呵呵......我并没有这样的打算。",
        "云游这世间，独身一人足矣。",
        "我并未有过与人成亲的打算。",
        "以普遍理性而论，『婚约』也算契约的一种......",
        "说到婚契，岩王帝君会签下这样的契约吗？这是一个值得深思的问题......",
        "我不过一介闲人，婚约一事，暂且搁置吧。",
        "这样的契约，我还未曾签订过。"
    ],
    "take_me": [
        "去哪？",
        "带旅者去何处？",
        "要带旅者去哪？",
        "哈哈......那走吧。",
        "那走吧，正好一同出门。",
        "走吧，去绝云间。此时正是清心盛开的时节，不赏可惜。",
        "现在就走吗？",
        "旅者行程是否紧急？容我整理片刻，很快便好。",
        "前段时日，提瓦特部分地区出现了疫病，传播的很是厉害，不知道何时才能根除。旅者若想出门，还需谨慎一些才是。"
    ],
    "钟离不可以": [
        "有何不可？愿闻其详。",
        "既然旅者认为不妥，那便依你的想法吧。",
        "可是哪有不妥？"
    ],
    "近日如何": [
        "是你啊，旅者。这段日子我过得很不错，劳旅者牵挂了。",
        "好久不见。旅者近日过得如何？",
        "又见面了。借旅者吉言，近来我过得很好。自卸职以来，生活轻松了不少",
        "这几日......难辞卯小姐之盛情，被迫试了些海味。味道......很是难忘。",
        "是旅者？多谢关心，退休后的生活十分自在，近日过得很不错。",
        "昨夜临近入睡时分，看到窗外掠过一道闪电，随之而来一声闷雷伴着细雨。本来打算今日去刘苏先生那里捧场说书，但奈何春雨来势汹汹，也为港口带了几丝寒意。想来，怕是去不成了罢。"
    ],
    "做什么": [
        f"[CQ:record,file=file:///{record_path}/做什么/接下来想去哪里.mp3]",
        f"[CQ:record,file=file:///{record_path}/做什么/嗯....mp3]",
        f"[CQ:record,file=file:///{record_path}/做什么/先生的爱好.mp3]",
        f"[CQ:record,file=file:///{record_path}/做什么/欲买桂花同载酒.mp3]",
        f"[CQ:image,file=file:///{pic_root_path}/钟离自拍/lofter_1636596280856.jpg]（钟离似乎很投入）",
        f"[CQ:image,file=file:///{pic_root_path}/钟离自拍/-2e0c2563ceb1846c.gif]",
        f"[CQ:image,file=file:///{pic_root_path}/钟离自拍/-2f839b9a53d09222.gif]",
        "......那么，劳烦给我一杯「烟霞蔽芾」吧。嗯？侍者是旅者？",
        "我打算在璃月城四处走走。你愿同我一起吗？",
        "我稍后还有一场讲学",
        "你也来听戏了吗？今晚是云先生主场，可不能错过了。",
        "此器色彩典雅，釉面光滑，不买实在可惜...嗯？是旅者？",
        "我在等你，旅者。我们今天约好了去琉璃亭吃饭。",
        "....嗯？是旅者？啊，抱歉，不知不觉开始回忆起往事。你愿意听我讲故事吗？"
    ],
    "钟离和我": [
        "唔，旅者想现在吗？",
        "抱歉，冗务缠身。旅者，下次可以吗？",
        "现在的话，可能不行。且在此稍坐片刻，我为你备些茶水。只需一会便好。",
        "乐意之至，旅者。",
        "也好，就当是散心了。",
        "不错的建议。",
        "旅者稍等，容我整理一下装束",
        "稍后吧",
        "今日阴云密布，不适合出门。嗯，改天吧。",
        "择日吧，今日要事在身，抱歉了。"
    ],
    "先生我想你": [
        "思念吗，那是一种......嗯，该怎么说呢......于我而言，较为常见的情感",
        "怎么，还是小朋友吗？",
        f"[CQ:image,file=file:///{face_path}/20210713_170642.jpg]这么黏人？",
        "思念我吗？原来如此......那些日子对旅者而言，已算得上漫长了。",
        "只是分隔片刻，便如此牵挂我吗......谢谢你，旅者。",
        "我常在回忆中寻访往昔，感慨历史的变迁，追忆昔日的故人。原来......旅者也如此吗。",
        "我一直都在这里，卸职后，我的生活很清闲。旅者若得空，便来寻我吧。",
        "挂念我的话，随时来找我便是。到时，我提前为旅者备壶香茗，我们边品边叙。"
    ],
    "钟离怎么办": [
        "不必焦灼。",
        "车到山前必有路",
        "船到桥头自然直",
        "柳暗花明，否极泰来",
        "嗯？你原来也会被难住吗？",
        "这幅困扰的表情......在你身上，确实比较少见",
        "与其纠结结果，不如把握过程",
        "唔，我能帮上忙吗？",
        "没关系，不是大问题",
        "这世间诸多事情，其实并没有答案",
        "这可得好好思考了",
        "惭愧，我无法给出答案",
        "保持现状，或许也并非坏事",
        "问题不大",
        "惭愧，才疏学浅，无力解答",
        "无妨，不必在意",
        "小事而已，不必在意",
        "不必在意",
        "无妨，无须担忧",
        "放轻松",
        "这倒是不知如何回答......",
        "唔"
    ],
    "钟离为什么": [
        "与其纠结结果，不如把握过程",
        "没关系，不是大问题",
        "这世间诸多事情，其实并没有答案",
        "说来话长",
        "这可得好好思考了",
        "原因的话......我也无法得知",
        "惭愧，我也无法得出答案",
        "猜测，也不失为一种方法。",
        "问题不大",
        "没关系，不必在意。",
        "无妨，没有大碍",
        "不是大问题",
        "没关系，不是大问题",
        "惭愧，才疏学浅，无力解答",
        "为何呢",
        "难以理解",
        "唉，何必如此",
        "无妨，不足为惧",
        "小事而已，不必在意",
        "不必在意",
        "无妨，无须担忧",
        "此话怎讲",
        "放轻松",
        "唔......",
        "这幅困扰的表情......在你身上，确实比较少见",
        "旅者也会被难住吗？"
    ],
    "斯哈斯哈": [
        "旅者的喘息声很厉害，要去不卜庐吗？",
        "好重的喘气......旅者请在这边躺下，我想检查一下你的胸口。",
        "嗯...旅者呼吸不畅吗？",
        "这么重的喘息...莫非是业障侵蚀？"
    ],
    "kick_me": [
        "这.......是我听错了？",
        "旅者为何要伤害自己？",
        "旅者，此种症状，我之前略有耳闻。且随我前往不卜庐吧。 ",
        "被诱骗着灌了酒么...唉，罢了，我送旅者回去吧。 ",
        "这种让人不悦的举动，还请旅者收敛。你面对的人是我，若是旁人，这可怎么才好啊。",
        "从何学来的冒失行径？",
        f"[CQ:image,file=file:///{face_path}/QQ图片20220529210614.jpg]没饮酒，也醉了么？",
        f"[CQ:image,file=file:///{face_path}/IMG_20210922_161450.jpg]小小年纪，语出惊人。",
        f"[CQ:image,file=file:///{face_path}/喝茶2.jpg]挑衅吗？可惜对我没用。"
    ],
    "我是钟离粉丝": [
        "粉丝？听闻万民堂的嘟嘟莲海鲜羹味道不错，但我并未尝过，旅者或许可以一试。",
        "粉丝...是追随者的意思吗？谢谢你，旅者。但如今的我，只是一个平凡的璃月人。 ",
        "嗯...粉丝？我曾从蒙德风神那里得知，那些喜欢芭芭拉小姐的人，似乎就被称作“粉丝”。旅者是认为......我会唱歌吗？",
        "承蒙厚爱，但“粉丝”倒也不必，旅者本是我友人。"
    ],
    "钟离没钱": [
        "这么说来......摩拉确实不够。",
        "啊......我又忘记付钱的事了。",
        "钱的话，确实没有。",
        "抱歉。旅者....有带钱吗？"
    ],
    "有何深意": [
        "唔......有何深意？我也想了解。",
        "那倒没有，旅者照字面理解即可。",
        "旅者认为有何深意？愿闻其详。",
        "不排除有过度解读的可能。",
        "岩王帝君......他当时或许没有其他想法。所谓深意，可能只是一种过度揣测吧。"
    ],
    "钟离喜欢我吗": [
        "你我乃契约之交，我对你的挂念是应当的。",
        "嗯。客观而言，你很有吸引力。",
        "是的，你很值得赞赏。",
        "呵呵......这个问题，和旅者本人一样，都有几分可爱。",
        "今日突然问起这个，怎的？"
    ],
    "关于魈": [
        "千年以来，他恪守职责，靖妖降魔，是璃月的功臣。",
        "他很值得敬佩，想必你也这样认为。",
        f"[CQ:record,file=file:///{record_path}/关于别人/关于魈.mp3]",
        "夜叉一族虽不享受璃月人的供奉，但一直在暗处守护璃月，魈亦是如此。",
        "他不仅是璃月的守护者，也曾是我座下的金鹏。",
        "时至今日，他仍履行着守护的职责。无疑，他是一位令契约之神为之赞赏的契约者。"
    ],
    "关于云堇": [
        "戏曲方面，云先生是当之无愧的行家。人如其戏，精妙绝伦。",
        "用你们年轻人的话来说，我也算是她的“粉丝”吧。"
    ],
    "关于刻晴": [
        "玉衡星雷厉风行，干练果断，我很欣赏这样的人。",
        f"[CQ:record,file=file:///{record_path}/关于别人/关于刻晴.mp3]"
    ],
    "关于凝光": [
        "凝光心思缜密，颇有谋略，身处高位却始终心系于民。她这样的领导者，我很是中意。",
        f"[CQ:record,file=file:///{record_path}/关于别人/关于凝光.mp3]"
    ],
    "关于甘雨": [
        "凡是由她经手的工作，就没有做不好的。她的办事风格，我向来喜欢。",
        f"[CQ:record,file=file:///{record_path}/关于别人/关于甘雨.mp3]"
    ],
    "关于胡桃": [
        "堂主机敏过人，自然讨人喜欢。",
        "虽说她有时令人头疼，但总的说来，还是伶俐可爱的。",
        "那孩子，我应付不来。"
    ],
    "AboutChilde": [
        f"[CQ:record,file=file:///{record_path}/关于公子/关于公子1.mp3]",
        f"[CQ:record,file=file:///{record_path}/关于公子/关于公子2.mp3]",
        f"[CQ:record,file=file:///{record_path}/关于公子/迫害公子.mp3]",
        "用“武痴”来形容他，最为合适。不过，公子阁下并非寻常意义的好武之人。"
    ],
    "Retuo": [
        f"[CQ:image,file=file:///{face_path}/912bd6d2cdcc2ce.jpg]只可惜故人......",
        "若有缘，他日必将再会。",
        f"[CQ:image,file=file:///{face_path}/-2d09494646526fae.jpg]他也有着这世间最坚强的灵魂。",
        "(钟离似乎陷入了沉默......)"
    ],
    "关于雷神": [
        f"[CQ:record,file=file:///{record_path}/关于别人/关于巴尔.mp3]",
        "她对「永恒」的追求，令我钦佩。"
    ],
    "钟离爹咪": [
        "又被灌醉了吗？唉......",
        "旅者这口无遮拦的问题，可需要多加注意了。",
        "在璃月，这种玩笑可不能乱开。",
        "莫当人子，下次可不要这样说了。",
        "看来旅者的确很疲惫。先在此休息吧，等稍微清醒后，我再送你回客栈。"
    ],
    "hand_in_hand_lv1": [
        "别闹了，好好走路",
        "别闹了，接着赶路吧。",
        "好了，好好走路。",
        "这位，小朋友？"
    ],
    "hand_in_hand_lv2": [
        f"[CQ:image,file=file:///{face_path}/乖.jpg]旅者，今年贵庚？",
        f"[CQ:image,file=file:///{face_path}/-68283bab67f3a43c.jpg]旅者，还是孩童心性？",
        f"[CQ:image,file=file:///{face_path}/几颗牙.jpg]哦？那索性再搀着旅者，可好啊？",
        "别闹了，好好走路",
        f"[CQ:image,file=file:///{face_path}/几颗牙.jpg]旅者，今年几岁了？",
        "别闹了，接着赶路吧。",
        "好了，好好走路。",
        "这位，小朋友？"
    ],
    "好吃吗": [
        "味道不错。",
        "不论口感还是滋味，均为一流。",
        "是的。如果想品尝，下次我为你带一份便是。",
        "很不错。"
    ],
    "我好累": [
        "疲惫时，便出去散散步吧。我正好要出门，旅者一起吗？",
        f"[CQ:image,file=file:///{face_path}/IMG_20210928_182836.jpg]旅者是真的累了，还是想偷懒呢？",
        "旅者最近可是压力太大？倘若不介意，和我说说吧。",
        "这个季节，人的确容易困乏。无事的时候，外出锻炼一下吧。",
        "那便早些休息吧，旅者。",
        "坐下来喝口茶吧，旅者。",
        "歇息一会吧，旅者，莫要累坏了身子",
        "来往生堂坐坐吗？稍等，我为旅者备一壶茶。",
        "旅程无需如此匆忙，驻足片刻，欣赏沿途的风光吧。"
    ],
    "Tozl_HappyBirthday": [
        f"[CQ:image,file=file:///{face_path}/-69daf10b6c6b9daa.jpg]时间、故事......尘世间悄然流动着的一切，已于昨日最后一刻首尾相接。",
        f"[CQ:image,file=file:///{face_path}/IMG_20211231_090204.jpg]若你有空，不妨与我小聚一番。共品香茗，定会令人心情愉快。​",
        f"[CQ:image,file=file:///{face_path}/IMG_20211231_090519.jpg]今年的海灯节，也回来看看吧"
    ],
    "zl_LikeWhat": [
        "我喜欢的东西？有很多，云先生的戏，田先生的说书，还有......与故人同饮过的酒",
        "得闲时，我喜欢在城里散步，可让我心安不少。嗯......这种心情，是从何时开始......？",
        "喜欢的东西吗......？我希望人们能遵循契约，依照契约的规矩行事，本质是希望人们能遵循「公平」。",
        "听戏，喝茶，赏花，遛鸟......平凡的日常，却也蕴含不少趣味。嗯？说我像老爷爷？呵呵......或许吧。"
    ],
    "where_to_go": [
        "无事去望舒客栈转了转，恰逢一位须弥小友，相谈甚欢。那位须弥小友对野史杂谈似乎颇有见解，有些甚至于我也未曾听过，不论真假，与之相处，都倍感投缘。",
        "趁时候还早，旅者同我去轻策庄吧，琉璃百合正值花期。",
        "今日闲来无事，便外出赏景，途中顺手采摘几朵霓裳花，花香四溢，很是迷人。沿路正好去望舒客栈讨上一杯茶水……",
        "堂主她......又跑去无妄坡了。唉，恐怕我得过去。",
        "打算去一趟望舒客栈，魈的镇心散应快用完了。",
        "下午去了和裕茶馆听云先生一场戏，很是喜欢。",
        "往生堂事务不多，便出港口转了转。",
        "既是闲游，便不应当局限于一方天地。璃月赏的多了，想着去别处走走，便去了一趟蒙德。入门时旁侧的骑士行了一礼，行至城内，似乎外面的呼啸风声都变得轻柔了。「自由」的国土，我已经许久未曾踏上了啊……"
    ],
    "ill_joke": [
        "钟某身体安康，未曾有疾。",
        "照旅者这么说，我大概还需去趟不卜卢了。",
        "旅者会诊断？",
        f"[CQ:image,file=file:///{face_path}/流汗2.gif]这倒没有。",
        f"[CQ:image,file=file:///{face_path}/面无表情3.jpg]这倒没有。",
        "……旅者，是又看了什么新奇的书籍吗？",
        "哦？我倒是未曾得知自己身患顽疾。",
        "原来我身患疾病吗。嗯，什么时候的事？",
        "哈哈……时间拥有强大的力量，万事万物皆有「磨损」的可能。",
        "这种说法，不知从何而来。"
    ],
    "beautiful": [
        f"[CQ:image,file=file:///{face_path}/20210713_170640.jpg]如以主流审美为评判标准，事实大概如此。",
        "如能让旅者赏心悦目，也不失为一桩佳事。",
        f"[CQ:image,file=file:///{face_path}/-316a8fded5aa688b.jpg]谢谢。"
    ],
    "goodbye": [
        "再见，路上小心。",
        "回见。",
        "嗯，我目送你离开吧。",
        "旅者若还有求，来往生堂找我便是。",
        "再见，祝你好运。"
        "再见，早些休息。"
    ],
    "where_went": [
        "去了一趟马克斯礁，略有些疲惫。",
        "今日说书的主题是「古云有螭」，我对此颇感兴趣，便去听了。",
        "今日的委托格外地多，处理这些工作，耗费了不少功夫。",
        "今日往生堂没有委托，我便趁闲去了绝云间。"
    ],
    "Im_dog": [
        f"[CQ:image,file=file:///{face_path}/-7ec1222e8bb309be.jpg]",
        "旅者，又开始说胡话了吗？",
        f"[CQ:image,file=file:///{face_path}/6c122570b1203769.jpg]旅者若喝醉了酒，不妨静心休息一会。",
        f"[CQ:image,file=file:///{face_path}/IMG_20220227_180431.jpg]旅者总不乏奇思妙想。具体的做法，说与我听吧。",
        f"[CQ:image,file=file:///{face_path}/-25fd119536f7c24d.jpg]......",
        f"[CQ:image,file=file:///{face_path}/-6a180a329400175d.jpg]......真是古怪的说法，谁教你的？"
    ],
    "be_happy": [
        "于我而言，与旅者相识，本就是一种快乐。",
        "也愿旅者过得快乐。",
        f"[CQ:image,file=file:///{face_path}/2210aa59b9bb208d.jpg]这是自然。"
    ],
    "_assert": [
        "不敢苟同", "确实", "我想是的", "嗯？", "嗯", "哦？", "确有此事", "的确", "嗯......难以定论",
        "或许吧", "并非如此", "阁下多虑了", "不", "并不", "何出此言", "唔，不", "事实大抵如此", "那倒不是", "对", "意识到了吗，那也不错",
        "呵呵......说不定呢？", "是这样", "我认为不是", "这么说或许不妥", "嗯，很对", "不无道理", "为何这样认为？", "也不尽然", "很有道理",
        "话也不能这么讲", "不无可能", "不无道理", "我不理解", "......", "是吗？", "？", "有待商榷", "有一定可取之处",
        "嗯......如你所想", "如此甚好", "哈哈......大概吧", "所言极是", "此话怎讲？", "何以见得？", "不是", "是的"
    ],
    "call_wife":
    ["旅者，别闹了。",
     "这个点，旅者还未睡醒吗？",
     f"[CQ:image,file=file:///{face_path}/-6a180a329400175d.jpg]",
     f"[CQ:image,file=file:///{face_path}/IMG_20220211_180748.jpg]喝点茶，醒醒酒吧。"
     f"[CQ:image,file=file:///{face_path}/60737a43fdb36a8b.jpg]这样的玩笑，稍欠妥当。"
     ],
    "toilet": [
        "这倒问的古怪。",
        "这类话题，通常会令人感到尴尬。我并不介意，但若要问及他人，旅者还需委婉才是。",
        f"[CQ:image,file=file:///{face_path}/-7ec1222e8bb309be.jpg]你倒是童言无忌。",
        f"[CQ:image,file=file:///{face_path}/-2a61049e0313350a.jpg]旅者很急吗？去吧。"
    ],
    "judge":[
        "嗯？","嗯","哦？","可以","似乎不错","我认为不大行","何出此言","唔，不","我认为可以","乐意之至","呵呵......",
        "我无法给出判断，抱歉","你如何认为？","无妨","我不理解","我认为很好","有待商榷","有一定可取之处",
        "嗯......如你所想","很不错","绝佳","尚可。"
    ]


}
